create table "type" (
	id serial primary key,
	"name" varchar(255)
);

create table product(
	id serial primary key,
	"name" varchar(255),
	type_id int references "type"(id),
	expired_date date,
	price float
);

insert into "type"
    ("name")
    values
    ('Сыр'), ('Мороженое'), ('Молоко'),
    ('Полуфабрикаты'), ('Хлебобулочные изделия'), ('Бакалея');

insert into product
    ("name", type_id, expired_date, price)
    values
    ('Сыр моцарелла', 1, '2024-01-31', 800.95),
    ('Сыр плавленный', 1, '2023-12-31', 500.76),
    ('Сыр пармезан', 1, '2023-12-30', 455.90),
    ('Сыр гауда', 1, '2024-03-01', 711.88),
    ('Мороженое молочное', 2, '2024-01-10', 505.44),
    ('Мороженое сырное', 2, '2023-10-01', 455.95),
    ('Мороженое сливочное', 2, '2024-02-23', 600.95),
    ('Молоко 1%', 3, '2024-02-23', 150.00),
    ('Молоко 2.5%', 3, '2024-04-01', 120.50),
    ('Молоко 0.05%', 3, '2024-01-23', 130.70),
    ('Пельмени с говядиной', 4, '2024-01-21', 744.66),
    ('Пельмени с сыром', 4, '2024-03-15', 977.33),
    ('Пельмени с курицей', 4, '2022-01-01', 100.18),
    ('Рулет мясной', 4, '2024-01-14', 904.82),
    ('Батон', 5, '2024-01-03', 36.05),
    ('Плюшка московская', 5, '2024-01-05', 30.25),
    ('Булочка сырная', 5, '2024-01-07', 50.00),
    ('Конфеты сырные', 6, '2024-02-16', 500.00),
    ('Шоколад', 6, '2024-05-20', 130.00),
    ('Мармелад', 6, '2024-04-17', 110.30);

-- 1. Написать запрос получение всех продуктов с типом "СЫР"
select "p".name as "Название продукта"
    from product as "p"
    inner join "type" as "t"
    on "p".type_id = "t".id
    where "t".name = 'Сыр';

-- 2. Написать запрос получения всех продуктов, у которых в имени есть слово "мороженое"
select "name" as "Наименование продукта"
    from product
    where "name" ilike '%мороженое%';

-- 3. Написать запрос, который выводит все продукты, срок годности которых уже истек
select "name" as "Протухло" from product
    where expired_date < current_date;

select "name" as "Протухло" from product
    where expired_date < now();

-- 4. Написать запрос, который выводит самый дорогой продукт.
-- Запрос должен быть универсальный и находить все продукты с максимальной ценой.
select max(price) as "Самая высокая цена",
    type_id as "Тип"
    from product
    group by type_id;

-- 5. Написать запрос, который выводит для каждого типа количество продуктов к нему принадлежащих. В виде имя_типа, количество
select "t".name as "Тип", count("p".id) as "Кол-во"
    from "type" as "t"
    inner join product as "p"
    on "t".id = "p".type_id
    group by "t".name
    order by "Кол-во" desc;

-- 6. Написать запрос получение всех продуктов с типом "СЫР" и "МОЛОКО"
select "p".name as "Название продукта",
    "t".name as "Тип"
    from product as "p"
    inner join "type" as "t"
    on "p".type_id = "t".id
    where "t".name = 'Сыр'
    or "t".name = 'Молоко';

-- 7. Написать запрос, который выводит тип продуктов,
-- которых осталось меньше 10 штук.
-- Под количеством подразумевается количество продуктов определенного типа.
select "t".name as "Тип"
    from "type" as "t"
    inner join product as "p"
    on "t".id = "p".type_id
    group by "t".name
    having count("p".name) < 10;

-- 8. Вывести все продукты и их тип.
select "p".name as "Наименование продукта",
    "t".name as "Тип продукта"
    from product as "p" inner join "type" as "t"
    on "p".type_id = "t".id;

